In [6]:
import pandas as pd

In [7]:
titanic = pd.read_excel('titanic3.xls')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [8]:
df = pd.DataFrame({'name': ['John', 'Mike', 'Sara', 'Jessica'], 'age': [25, 30, 35, 40], 'gender': ['M','M', 'F', 'F']})
df

      name  age gender
0     John   25      M
1     Mike   30      M
2     Sara   35      F
3  Jessica   40      F

In [9]:
print(df.iloc[0])

name      John
age         25
gender       M
Name: 0, dtype: object

In [11]:
# Seleccionar las primeras dos filas del DataFramexexc
print(df.iloc[:3])

   name  age gender
0  John   25      M
1  Mike   30      M
2  Sara   35      F

In [13]:
# Seleccionar la primera fila y la segunda columna del DataFrame; gender de la primera persona
print(df.iloc[0, 2])

M

In [14]:
# Seleccionar todas las filas donde la edad es mayor que 30
ageGrater30 = titanic.loc[(titanic['age'] > 30)]
ageGrater30

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [16]:
# Seleccionar todas las filas donde la clase es 1ra clase.
titanic.loc[(titanic['pclass'] == 1)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
318,1,0,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S,NaN,NaN,"London, England"
319,1,1,"Wilson, Miss. Helen Alice",female,31.0000,0,0,16966,134.5000,E39 E41,C,3,NaN,NaN
320,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S,D,NaN,"London, England"
321,1,0,"Wright, Mr. George",male,62.0000,0,0,113807,26.5500,NaN,S,NaN,NaN,"Halifax, NS"
322,1,1,"Young, Miss. Marie Grice",female,36.0000,0,0,PC 17760,135.6333,C32,C,8,NaN,"New York, NY / Washington, DC"

In [19]:
# Seleccionar todas las filas donde la edad es mayor que 30 y la clase es 1ra clase.
titanic.loc[(titanic['age'] < 19) & (titanic['pclass'] == 1)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
53,1,0,"Carrau, Mr. Jose Pedro",male,17.0000,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
54,1,1,"Carter, Master. William Thornton II",male,11.0000,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
55,1,1,"Carter, Miss. Lucile Polk",female,14.0000,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
92,1,1,"Dick, Mrs. Albert Adrian (Vera Gillespie)",female,17.0000,1,0,17474,57.0000,B20,S,3,NaN,"Calgary, AB"
94,1,1,"Dodge, Master. Washington",male,4.0000,0,2,33638,81.8583,A34,S,5,NaN,"San Francisco, CA"
159,1,1,"Hippach, Miss. Jean Gertrude",female,16.0000,0,1,111361,57.9792,B18,C,4,NaN,"Chicago, IL"
187,1,1,"Lines, Miss. Mary Conover",female,16.0000,0,1,PC 17592,39.4000,D28,S,9,NaN,"Paris, France"
193,1,1,"Madill, Miss. Georgette Alexandra",female,15.0000,0,1,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
195,1,1,"Maioni, Miss. Roberta",female,16.0000,0,0,110152,86.5000,B79,S,8,NaN,NaN
198,1,1,"Marvin, Mrs. Daniel Warner (Mary Graham Carmic...",female,18.0000,1,0,113773,53.1000,D30,S,10,NaN,"New York, NY"
228,1,0,"Penasco y Castellana, Mr. Victor de Satode",male,18.0000,1,0,PC 17758,108.9000,C65,C,NaN,NaN,"Madrid, Spain"
229,1,1,"Penasco y Castellana, Mrs. Victor de Satode (M...",female,17.0000,1,0,PC 17758,108.9000,C65,C,8,NaN,"Madrid, Spain"
249,1,1,"Ryerson, Master. John Borie",male,13.0000,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,4,NaN,"Haverford, PA / Cooperstown, NY"
250,1,1,"Ryerson, Miss. Emily Borie",female,18.0000,2,2,PC 17608,262.3750,B57 B59 B63 B66,C,4,NaN,"Haverford, PA / Cooperstown, NY"
270,1,1,"Smith, Mrs. Lucien Philip (Mary Eloise Hughes)",female,18.0000,1,0,13695,60.0000,C31,S,6,NaN,"Huntington, WV"
273,1,1,"Spedden, Master. Robert Douglas",male,6.0000,0,2,16966,134.5000,E34,C,3,NaN,"Tuxedo Park, NY"
289,1,1,"Taussig, Miss. Ruth",female,18.0000,0,2,110413,79.6500,E68,S,8,NaN,"New York, NY"
295,1,1,"Thayer, Mr. John Borland Jr",male,17.0000,0,2,17421,110.8833,C70,C,B,NaN,"Haverford, PA"

In [20]:
# Seleccionar todas las filas donde el nombre comienza con "Mr.".
titanic.loc[titanic['name'].str.startswith('A')]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
649,3,0,"Assam, Mr. Ali",male,23.0000,0,0,SOTON/O.Q. 3101309,7.0500,NaN,S,NaN,NaN,NaN
650,3,0,"Attalah, Miss. Malake",female,17.0000,0,0,2627,14.4583,NaN,C,NaN,NaN,NaN
651,3,0,"Attalah, Mr. Sleiman",male,30.0000,0,0,2694,7.2250,NaN,C,NaN,NaN,"Ottawa, ON"
652,3,0,"Augustsson, Mr. Albert",male,23.0000,0,0,347468,7.8542,NaN,S,NaN,NaN,"Krakoryd, Sweden Bloomington, IL"
653,3,1,"Ayoub, Miss. Banoura",female,13.0000,0,0,2687,7.2292,NaN,C,C,NaN,"Syria Youngstown, OH"

isin: El operador isin() se utiliza para filtrar un DataFrame por una lista de valores. Por ejemplo,
para filtrar un DataFrame para que solo contenga pasajeros de primera clase, puede usar el siguiente
código:

In [21]:
titanic[titanic['pclass'].isin([1])]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
318,1,0,"Williams-Lambert, Mr. Fletcher Fellows",male,NaN,0,0,113510,35.0000,C128,S,NaN,NaN,"London, England"
319,1,1,"Wilson, Miss. Helen Alice",female,31.0000,0,0,16966,134.5000,E39 E41,C,3,NaN,NaN
320,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S,D,NaN,"London, England"
321,1,0,"Wright, Mr. George",male,62.0000,0,0,113807,26.5500,NaN,S,NaN,NaN,"Halifax, NS"
322,1,1,"Young, Miss. Marie Grice",female,36.0000,0,0,PC 17760,135.6333,C32,C,8,NaN,"New York, NY / Washington, DC"

between: El operador between() se utiliza para filtrar un DataFrame por un rango de valores. Por
ejemplo, para filtrar un DataFrame para que solo contenga pasajeros que tienen entre 18 y 30 años,
puede usar el siguiente código:

In [24]:
titanic[titanic['age'].between(0, 18)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY"
53,1,0,"Carrau, Mr. Jose Pedro",male,17.0000,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
54,1,1,"Carter, Master. William Thornton II",male,11.0000,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1275,3,0,"Vander Planke, Mr. Leo Edmondus",male,16.0000,2,0,345764,18.0000,NaN,S,NaN,NaN,NaN
1279,3,0,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0000,0,0,350406,7.8542,NaN,S,NaN,NaN,NaN
1288,3,0,"Wiklund, Mr. Jakob Alfred",male,18.0000,1,0,3101267,6.4958,NaN,S,NaN,314.0,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0000,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN

query: La función query() se utiliza para filtrar un DataFrame por una condición. La condición se
puede especificar como una cadena o como una expresión. Por ejemplo, para filtrar un DataFrame
para que solo contenga pasajeros que sobrevivieron al accidente, puede usar el siguiente código:

In [25]:
titanic[titanic['survived'] == 1]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1261,3,1,"Turkula, Mrs. (Hedwig)",female,63.0000,0,0,4134,9.5875,NaN,S,15,NaN,NaN
1277,3,1,"Vartanian, Mr. David",male,22.0000,0,0,2658,7.2250,NaN,C,13 15,NaN,NaN
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0000,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0000,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0000,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN

groupby: La función groupby() se utiliza para agrupar un DataFrame por uno o más valores. Los
grupos se pueden usar para realizar operaciones estadísticas o para crear nuevos DataFrames. Por
ejemplo, para agrupar un DataFrame por el valor de la columna pclass y calcular la media de la
columna age, puede usar el siguiente código:

In [32]:
survived = titanic[titanic['survived'] == 1]
survived.groupby('pclass')['age'].mean()

pclass
1    36.833794
2    24.858696
3    21.545166
Name: age, dtype: float64

¿Cuál es la edad promedio de los pasajeros que sobrevivieron, agrupados por clase?

¿Cuál es la edad promedio de los pasajeros que murieron, agrupados por clase?

In [35]:
died = titanic[titanic['survived'] == 0]
died.groupby('pclass')['age'].mean()

pclass
1    43.247573
2    33.167808
3    25.974549
Name: age, dtype: float64

3.¿Cuál es la diferencia de edad promedio entre los pasajeros que sobrevivieron y los que
murieron, agrupados por clase?

In [42]:
titanic[['pclass', 'survived']].groupby(['pclass'], as_index=False).mean().sort_values(by='pclass', ascending=True)

   pclass  survived
0       1  0.619195
1       2  0.429603
2       3  0.255289

In [46]:
titanic[["sex", "survived"]].groupby(['sex'], as_index=False).mean().sort_values(by='survived', ascending=False)

      sex  survived
0  female  0.727468
1    male  0.190985